thelemon22/regis/dsPIC33E/h/p33EP512MU810.h
extern volatile unsigned int  IPC14 __attribute__((__sfr__));
__extension__ typedef struct tagIPC14BITS {
  union {
    struct {
      unsigned C2IP:3;
      unsigned :1;
      unsigned PSEMIP:3;
      unsigned :1;
      unsigned QEI1IP:3;
      unsigned :1;
      unsigned DCIEIP:3;
    };
    struct {
      unsigned C2IP0:1;
      unsigned C2IP1:1;
      unsigned C2IP2:1;
      unsigned :1;
      unsigned PSEMIP0:1;
      unsigned PSEMIP1:1;
      unsigned PSEMIP2:1;
      unsigned :1;
      unsigned QEI1IP0:1;
      unsigned QEI1IP1:1;
      unsigned QEI1IP2:1;
      unsigned :1;
      unsigned DCIEIP0:1;
      unsigned DCIEIP1:1;
      unsigned DCIEIP2:1;
    };
  };
} IPC14BITS;
extern volatile IPC14BITS IPC14bits __attribute__((__sfr__));

extern volatile unsigned int  IPC15 __attribute__((__sfr__));
__extension__ typedef struct tagIPC15BITS {
  union {
    struct {
      unsigned DCIIP:3;
      unsigned :1;
      unsigned DMA5IP:3;
      unsigned :1;
      unsigned RTCIP:3;
    };
    struct {
      unsigned DCIIP0:1;
      unsigned DCIIP1:1;
      unsigned DCIIP2:1;
      unsigned :1;
      unsigned DMA5IP0:1;
      unsigned DMA5IP1:1;
      unsigned DMA5IP2:1;
      unsigned :1;
      unsigned RTCIP0:1;
      unsigned RTCIP1:1;
      unsigned RTCIP2:1;
    };
  };
} IPC15BITS;
extern volatile IPC15BITS IPC15bits __attribute__((__sfr__));

extern volatile unsigned int  IPC16 __attribute__((__sfr__));
__extension__ typedef struct tagIPC16BITS {
  union {
    struct {
      unsigned :4;
      unsigned U1EIP:3;
      unsigned :1;
      unsigned U2EIP:3;
      unsigned :1;
      unsigned CRCIP:3;
    };
    struct {
      unsigned :4;
      unsigned U1EIP0:1;
      unsigned U1EIP1:1;
      unsigned U1EIP2:1;
      unsigned :1;
      unsigned U2EIP0:1;
      unsigned U2EIP1:1;
      unsigned U2EIP2:1;
      unsigned :1;
      unsigned CRCIP0:1;
      unsigned CRCIP1:1;
      unsigned CRCIP2:1;
    };
  };
} IPC16BITS;
extern volatile IPC16BITS IPC16bits __attribute__((__sfr__));

extern volatile unsigned int  IPC17 __attribute__((__sfr__));
__extension__ typedef struct tagIPC17BITS {
  union {
    struct {
      unsigned DMA6IP:3;
      unsigned :1;
      unsigned DMA7IP:3;
      unsigned :1;
      unsigned C1TXIP:3;
      unsigned :1;
      unsigned C2TXIP:3;
    };
    struct {
      unsigned DMA6IP0:1;
      unsigned DMA6IP1:1;
      unsigned DMA6IP2:1;
      unsigned :1;
      unsigned DMA7IP0:1;
      unsigned DMA7IP1:1;
      unsigned DMA7IP2:1;
      unsigned :1;
      unsigned C1TXIP0:1;
      unsigned C1TXIP1:1;
      unsigned C1TXIP2:1;
      unsigned :1;
      unsigned C2TXIP0:1;
      unsigned C2TXIP1:1;
      unsigned C2TXIP2:1;
    };
  };
} IPC17BITS;
extern volatile IPC17BITS IPC17bits __attribute__((__sfr__));

extern volatile unsigned int  IPC18 __attribute__((__sfr__));
__extension__ typedef struct tagIPC18BITS {
  union {
    struct {
      unsigned :4;
      unsigned PSESMIP:3;
      unsigned :5;
      unsigned QEI2IP:3;
    };
    struct {
      unsigned :4;
      unsigned PSESMIP0:1;
      unsigned PSESMIP1:1;
      unsigned PSESMIP2:1;
      unsigned :5;
      unsigned QEI2IP0:1;
      unsigned QEI2IP1:1;
      unsigned QEI2IP2:1;
    };
  };
} IPC18BITS;
extern volatile IPC18BITS IPC18bits __attribute__((__sfr__));

extern volatile unsigned int  IPC20 __attribute__((__sfr__));
__extension__ typedef struct tagIPC20BITS {
  union {
    struct {
      unsigned :4;
      unsigned U3EIP:3;
      unsigned :1;
      unsigned U3RXIP:3;
      unsigned :1;
      unsigned U3TXIP:3;
    };
    struct {
      unsigned :4;
      unsigned U3EIP0:1;
      unsigned U3EIP1:1;
      unsigned U3EIP2:1;
      unsigned :1;
      unsigned U3RXIP0:1;
      unsigned U3RXIP1:1;
      unsigned U3RXIP2:1;
      unsigned :1;
      unsigned U3TXIP0:1;
      unsigned U3TXIP1:1;
      unsigned U3TXIP2:1;
    };
  };
} IPC20BITS;
extern volatile IPC20BITS IPC20bits __attribute__((__sfr__));

extern volatile unsigned int  IPC21 __attribute__((__sfr__));
__extension__ typedef struct tagIPC21BITS {
  union {
    struct {
      unsigned :8;
      unsigned USB1IP:3;
      unsigned :1;
      unsigned U4EIP:3;
    };
    struct {
      unsigned :8;
      unsigned USB1IP0:1;
      unsigned USB1IP1:1;
      unsigned USB1IP2:1;
      unsigned :1;
      unsigned U4EIP0:1;
      unsigned U4EIP1:1;
      unsigned U4EIP2:1;
    };
  };
} IPC21BITS;
extern volatile IPC21BITS IPC21bits __attribute__((__sfr__));

extern volatile unsigned int  IPC22 __attribute__((__sfr__));
__extension__ typedef struct tagIPC22BITS {
  union {
    struct {
      unsigned U4RXIP:3;
      unsigned :1;
      unsigned U4TXIP:3;
      unsigned :1;
      unsigned SPI3EIP:3;
      unsigned :1;
      unsigned SPI3IP:3;
    };
    struct {
      unsigned U4RXIP0:1;
      unsigned U4RXIP1:1;
      unsigned U4RXIP2:1;
      unsigned :1;
      unsigned U4TXIP0:1;
      unsigned U4TXIP1:1;
      unsigned U4TXIP2:1;
      unsigned :1;
      unsigned SPI3EIP0:1;
      unsigned SPI3EIP1:1;
      unsigned SPI3EIP2:1;
      unsigned :1;
      unsigned SPI3IP0:1;
      unsigned SPI3IP1:1;
      unsigned SPI3IP2:1;
    };
  };
} IPC22BITS;
extern volatile IPC22BITS IPC22bits __attribute__((__sfr__));

extern volatile unsigned int  IPC23 __attribute__((__sfr__));
__extension__ typedef struct tagIPC23BITS {
  union {
    struct {
      unsigned OC9IP:3;
      unsigned :1;
      unsigned IC9IP:3;
      unsigned :1;
      unsigned PWM1IP:3;
      unsigned :1;
      unsigned PWM2IP:3;
    };
    struct {
      unsigned OC9IP0:1;
      unsigned OC9IP1:1;
      unsigned OC9IP2:1;
      unsigned :1;
      unsigned IC9IP0:1;
      unsigned IC9IP1:1;
      unsigned IC9IP2:1;
      unsigned :1;
      unsigned PWM1IP0:1;
      unsigned PWM1IP1:1;
      unsigned PWM1IP2:1;
      unsigned :1;
      unsigned PWM2IP0:1;
      unsigned PWM2IP1:1;
      unsigned PWM2IP2:1;
    };
  };
} IPC23BITS;
extern volatile IPC23BITS IPC23bits __attribute__((__sfr__));

extern volatile unsigned int  IPC24 __attribute__((__sfr__));
__extension__ typedef struct tagIPC24BITS {
  union {
    struct {
      unsigned PWM3IP:3;
      unsigned :1;
      unsigned PWM4IP:3;
      unsigned :1;
      unsigned PWM5IP:3;
      unsigned :1;
      unsigned PWM6IP:3;
    };
    struct {
      unsigned PWM3IP0:1;
      unsigned PWM3IP1:1;
      unsigned PWM3IP2:1;
      unsigned :1;
      unsigned PWM4IP0:1;
      unsigned PWM4IP1:1;
      unsigned PWM4IP2:1;
      unsigned :1;
      unsigned PWM5IP0:1;
      unsigned PWM5IP1:1;
      unsigned PWM5IP2:1;
      unsigned :1;
      unsigned PWM6IP0:1;
      unsigned PWM6IP1:1;
      unsigned PWM6IP2:1;
    };
  };
} IPC24BITS;
extern volatile IPC24BITS IPC24bits __attribute__((__sfr__));

extern volatile unsigned int  IPC29 __attribute__((__sfr__));
__extension__ typedef struct tagIPC29BITS {
  union {
    struct {
      unsigned :8;
      unsigned DMA8IP:3;
      unsigned :1;
      unsigned DMA9IP:3;
    };
    struct {
      unsigned :8;
      unsigned DMA8IP0:1;
      unsigned DMA8IP1:1;
      unsigned DMA8IP2:1;
      unsigned :1;
      unsigned DMA9IP0:1;
      unsigned DMA9IP1:1;
      unsigned DMA9IP2:1;
    };
  };
} IPC29BITS;
extern volatile IPC29BITS IPC29bits __attribute__((__sfr__));

extern volatile unsigned int  IPC30 __attribute__((__sfr__));
__extension__ typedef struct tagIPC30BITS {
  union {
    struct {
      unsigned DMA10IP:3;
      unsigned :1;
      unsigned DMA11IP:3;
      unsigned :1;
      unsigned SPI4EIP:3;
      unsigned :1;
      unsigned SPI4IP:3;
    };
    struct {
      unsigned DMA10IP0:1;
      unsigned DMA10IP1:1;
      unsigned DMA10IP2:1;
      unsigned :1;
      unsigned DMA11IP0:1;
      unsigned DMA11IP1:1;
      unsigned DMA11IP2:1;
      unsigned :1;
      unsigned SPI4EIP0:1;
      unsigned SPI4EIP1:1;
      unsigned SPI4EIP2:1;
      unsigned :1;
      unsigned SPI4IP0:1;
      unsigned SPI4IP1:1;
      unsigned SPI4IP2:1;
    };
  };
} IPC30BITS;
extern volatile IPC30BITS IPC30bits __attribute__((__sfr__));

extern volatile unsigned int  IPC31 __attribute__((__sfr__));
__extension__ typedef struct tagIPC31BITS {
  union {
    struct {
      unsigned OC10IP:3;
      unsigned :1;
      unsigned IC10IP:3;
      unsigned :1;
      unsigned OC11IP:3;
      unsigned :1;
      unsigned IC11IP:3;
    };
    struct {
      unsigned OC10IP0:1;
      unsigned OC10IP1:1;
      unsigned OC10IP2:1;
      unsigned :1;
      unsigned IC10IP0:1;
      unsigned IC10IP1:1;
      unsigned IC10IP2:1;
      unsigned :1;
      unsigned OC11IP0:1;
      unsigned OC11IP1:1;
      unsigned OC11IP2:1;
      unsigned :1;
      unsigned IC11IP0:1;
      unsigned IC11IP1:1;
      unsigned IC11IP2:1;
    };
  };
} IPC31BITS;
extern volatile IPC31BITS IPC31bits __attribute__((__sfr__));

extern volatile unsigned int  IPC32 __attribute__((__sfr__));
__extension__ typedef struct tagIPC32BITS {
  union {
    struct {
      unsigned OC12IP:3;
      unsigned :1;
      unsigned IC12IP:3;
      unsigned :1;
      unsigned DMA12IP:3;
      unsigned :1;
      unsigned DMA13IP:3;
    };
    struct {
      unsigned OC12IP0:1;
      unsigned OC12IP1:1;
      unsigned OC12IP2:1;
      unsigned :1;
      unsigned IC12IP0:1;
      unsigned IC12IP1:1;
      unsigned IC12IP2:1;
      unsigned :1;
      unsigned DMA12IP0:1;
      unsigned DMA12IP1:1;
      unsigned DMA12IP2:1;
      unsigned :1;
      unsigned DMA13IP0:1;
      unsigned DMA13IP1:1;
      unsigned DMA13IP2:1;
    };
  };
} IPC32BITS;
extern volatile IPC32BITS IPC32bits __attribute__((__sfr__));

