thelemon22/regis/dsPIC33E/h/p33EP512MU810.h
extern volatile DMA14REQBITS DMA14REQbits __attribute__((__sfr__));

extern volatile unsigned int  DMA14STAL __attribute__((__sfr__));
extern volatile unsigned int  DMA14STAH __attribute__((__sfr__));
typedef struct tagDMA14STAHBITS {
  unsigned STA:8;
} DMA14STAHBITS;
extern volatile DMA14STAHBITS DMA14STAHbits __attribute__((__sfr__));

extern volatile unsigned int  DMA14STBL __attribute__((__sfr__));
extern volatile unsigned int  DMA14STBH __attribute__((__sfr__));
typedef struct tagDMA14STBHBITS {
  unsigned STB:8;
} DMA14STBHBITS;
extern volatile DMA14STBHBITS DMA14STBHbits __attribute__((__sfr__));

extern volatile unsigned int  DMA14PAD __attribute__((__sfr__));
extern volatile unsigned int  DMA14CNT __attribute__((__sfr__));
typedef struct tagDMA14CNTBITS {
  unsigned CNT:14;
} DMA14CNTBITS;
extern volatile DMA14CNTBITS DMA14CNTbits __attribute__((__sfr__));

extern volatile unsigned int  DMAPWC __attribute__((__sfr__));
typedef struct tagDMAPWCBITS {
  unsigned PWCOL0:1;
  unsigned PWCOL1:1;
  unsigned PWCOL2:1;
  unsigned PWCOL3:1;
  unsigned PWCOL4:1;
  unsigned PWCOL5:1;
  unsigned PWCOL6:1;
  unsigned PWCOL7:1;
  unsigned PWCOL8:1;
  unsigned PWCOL9:1;
  unsigned PWCOL10:1;
  unsigned PWCOL11:1;
  unsigned PWCOL12:1;
  unsigned PWCOL13:1;
  unsigned PWCOL14:1;
} DMAPWCBITS;
extern volatile DMAPWCBITS DMAPWCbits __attribute__((__sfr__));

extern volatile unsigned int  DMARQC __attribute__((__sfr__));
typedef struct tagDMARQCBITS {
  unsigned RQCOL0:1;
  unsigned RQCOL1:1;
  unsigned RQCOL2:1;
  unsigned RQCOL3:1;
  unsigned RQCOL4:1;
  unsigned RQCOL5:1;
  unsigned RQCOL6:1;
  unsigned RQCOL7:1;
  unsigned RQCOL8:1;
  unsigned RQCOL9:1;
  unsigned RQCOL10:1;
  unsigned RQCOL11:1;
  unsigned RQCOL12:1;
  unsigned RQCOL13:1;
  unsigned RQCOL14:1;
} DMARQCBITS;
extern volatile DMARQCBITS DMARQCbits __attribute__((__sfr__));

extern volatile unsigned int  DMAPPS __attribute__((__sfr__));
typedef struct tagDMAPPSBITS {
  unsigned PPST0:1;
  unsigned PPST1:1;
  unsigned PPST2:1;
  unsigned PPST3:1;
  unsigned PPST4:1;
  unsigned PPST5:1;
  unsigned PPST6:1;
  unsigned PPST7:1;
  unsigned PPST8:1;
  unsigned PPST9:1;
  unsigned PPST10:1;
  unsigned PPST11:1;
  unsigned PPST12:1;
  unsigned PPST13:1;
  unsigned PPST14:1;
} DMAPPSBITS;
extern volatile DMAPPSBITS DMAPPSbits __attribute__((__sfr__));

extern volatile unsigned int  DMALCA __attribute__((__sfr__));
__extension__ typedef struct tagDMALCABITS {
  union {
    struct {
      unsigned LSTCH:4;
    };
    struct {
      unsigned LSTCH0:1;
      unsigned LSTCH1:1;
      unsigned LSTCH2:1;
      unsigned LSTCH3:1;
    };
  };
} DMALCABITS;
extern volatile DMALCABITS DMALCAbits __attribute__((__sfr__));

extern volatile unsigned int  DSADRL __attribute__((__sfr__));
extern volatile unsigned int  DSADRH __attribute__((__sfr__));
typedef struct tagDSADRHBITS {
  unsigned DSADR:8;
} DSADRHBITS;
extern volatile DSADRHBITS DSADRHbits __attribute__((__sfr__));

extern volatile unsigned int  PTCON __attribute__((__sfr__));
__extension__ typedef struct tagPTCONBITS {
  union {
    struct {
      unsigned SEVTPS:4;
      unsigned SYNCSRC:3;
      unsigned SYNCEN:1;
      unsigned SYNCOEN:1;
      unsigned SYNCPOL:1;
      unsigned EIPU:1;
      unsigned SEIEN:1;
      unsigned SESTAT:1;
      unsigned PTSIDL:1;
      unsigned :1;
      unsigned PTEN:1;
    };
    struct {
      unsigned SEVTPS0:1;
      unsigned SEVTPS1:1;
      unsigned SEVTPS2:1;
      unsigned SEVTPS3:1;
      unsigned SYNCSRC0:1;
      unsigned SYNCSRC1:1;
      unsigned SYNCSRC2:1;
    };
  };
} PTCONBITS;
extern volatile PTCONBITS PTCONbits __attribute__((__sfr__));

extern volatile unsigned int  PTCON2 __attribute__((__sfr__));
__extension__ typedef struct tagPTCON2BITS {
  union {
    struct {
      unsigned PCLKDIV:3;
    };
    struct {
      unsigned PCLKDIV0:1;
      unsigned PCLKDIV1:1;
      unsigned PCLKDIV2:1;
    };
  };
} PTCON2BITS;
extern volatile PTCON2BITS PTCON2bits __attribute__((__sfr__));

extern volatile unsigned int  PTPER __attribute__((__sfr__));
extern volatile unsigned int  SEVTCMP __attribute__((__sfr__));
extern volatile unsigned int  MDC __attribute__((__sfr__));
extern volatile unsigned int  STCON __attribute__((__sfr__));
__extension__ typedef struct tagSTCONBITS {
  union {
    struct {
      unsigned SEVTPS:4;
      unsigned SYNCSRC:3;
      unsigned SYNCEN:1;
      unsigned SYNCOEN:1;
      unsigned SYNCPOL:1;
      unsigned EIPU:1;
      unsigned SEIEN:1;
      unsigned SESTAT:1;
    };
    struct {
      unsigned SEVTPS0:1;
      unsigned SEVTPS1:1;
      unsigned SEVTPS2:1;
      unsigned SEVTPS3:1;
      unsigned SYNCSRC0:1;
      unsigned SYNCSRC1:1;
      unsigned SYNCSRC2:1;
    };
  };
} STCONBITS;
extern volatile STCONBITS STCONbits __attribute__((__sfr__));

extern volatile unsigned int  STCON2 __attribute__((__sfr__));
__extension__ typedef struct tagSTCON2BITS {
  union {
    struct {
      unsigned PCLKDIV:3;
    };
    struct {
      unsigned PCLKDIV0:1;
      unsigned PCLKDIV1:1;
      unsigned PCLKDIV2:1;
    };
  };
} STCON2BITS;
extern volatile STCON2BITS STCON2bits __attribute__((__sfr__));

extern volatile unsigned int  STPER __attribute__((__sfr__));
extern volatile unsigned int  SSEVTCMP __attribute__((__sfr__));
extern volatile unsigned int  CHOP __attribute__((__sfr__));
__extension__ typedef struct tagCHOPBITS {
  union {
    struct {
      unsigned CHOPCLK:10;
      unsigned :5;
      unsigned CHPCLKEN:1;
    };
    struct {
      unsigned CHOPCLK0:1;
      unsigned CHOPCLK1:1;
      unsigned CHOPCLK2:1;
      unsigned CHOPCLK3:1;
      unsigned CHOPCLK4:1;
      unsigned CHOPCLK5:1;
      unsigned CHOPCLK6:1;
      unsigned CHOPCLK7:1;
      unsigned CHOPCLK8:1;
      unsigned CHOPCLK9:1;
    };
  };
} CHOPBITS;
extern volatile CHOPBITS CHOPbits __attribute__((__sfr__));

extern volatile unsigned int  PWMCON1 __attribute__((__sfr__));
__extension__ typedef struct tagPWMCON1BITS {
  union {
    struct {
      unsigned IUE:1;
      unsigned XPRES:1;
      unsigned CAM:1;
      unsigned MTBS:1;
      unsigned :1;
      unsigned DTCP:1;
      unsigned DTC:2;
      unsigned MDCS:1;
      unsigned ITB:1;
      unsigned TRGIEN:1;
      unsigned CLIEN:1;
      unsigned FLTIEN:1;
      unsigned TRGSTAT:1;
      unsigned CLSTAT:1;
      unsigned FLTSTAT:1;
    };
    struct {
      unsigned :6;
      unsigned DTC0:1;
      unsigned DTC1:1;
    };
  };
} PWMCON1BITS;
